---
kind: method
id: M:Autodesk.Revit.DB.LayoutRuleFixedNumber.#ctor(System.Int32)
source: html/74f3a986-a399-97ec-6068-df8e37a0fe67.htm
---
# Autodesk.Revit.DB.LayoutRuleFixedNumber.#ctor Method

Constructor of LayoutRuleFixedNumber.

## Syntax (C#)
```csharp
public LayoutRuleFixedNumber(
	int numberOfLines
)
```

## Parameters
- **numberOfLines** (`System.Int32`) - The value of numberOfLines must be positive.

## Remarks
Create a LayoutRuleFixedNumber object with the number of the beams and this number must be positive.